app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-05-21 18:18:52.559538"], ["title", "Nasa-funded study: industrial civilisation headed for 'irreversible collapse'?"], ["updated_at", "2014-05-21 18:18:52.559538"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "updated_at" = $1, "votes" = $2 WHERE "posts"."id" = 4  [["updated_at", "2014-05-21 15:14:59.360453"], ["votes", 3]]